code/Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<BasedOn>
				<xr:Item>Document.Договор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаличными</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудник</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code/Documents/Оплата/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Оплата.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Оплата.Дата,
	|	Оплата.Клиент,
	|	Оплата.Номер,
	|	Оплата.Сотрудник,
	|	Оплата.Сумма,
	|	Оплата.СуммаНаличными
	|ИЗ
	|	Документ.Оплата КАК Оплата
	|ГДЕ
	|	Оплата.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок"); 
	ОбластьЗаголовок.Параметры.НаименованиеОрганизацииПолное = Константы.НаименованиеОрганизацииПолное.Получить(); 
	ОбластьЗаголовок.Параметры.ТелефонОрганизации = Константы.Телефон.Получить();
	ОбластьЗаголовок.Параметры.АдресОрганизации = Константы.АдресОрганизации.Получить();
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	Расчет = Макет.ПолучитьОбласть("Расчет"); 
	Итог = Макет.ПолучитьОбласть("Итог"); 
	Подвал = Макет.ПолучитьОбласть("Подвал"); 	
		ТабДок.Очистить();
	ВставлятьРазделительСтраниц = Ложь; 
	Итого = 0;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли; 	
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);  
		ТабДок.Вывести(ОбластьЗаголовок); 		 
        Шапка.Параметры.Заполнить(Выборка); 
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		Расчет.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Расчет);
		Итого = Расчет.Параметры.СуммаНаличными - Расчет.Параметры.Сумма;
		ВставлятьРазделительСтраниц = Истина;  	
	КонецЦикла;                      
	Итог.Параметры.Сдача = Итого;
	ТабДок.Вывести(Итог);
	Подвал.Параметры.Заполнить(Выборка);
	ТабДок.Вывести(Подвал);

	
	//}}
КонецПроцедуры
